index.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+TITLE: Nasjonalt traumeregister
#+SUBTITLE: Resultattjenester versjon 0.03
* Nyhet
- Resultater kan vises for hele landet, HF, RHF eller sykehusnivå
* Inledning
Dette er et forsøk for å lage en resultatpresentasjon ved bruk av [[https://www.r-project.org/][R]] for analyse og
[[https://shiny.rstudio.com/][Shiny]] for interaktiv presentasjon.
* Filstruktur
* Hva trenger man for å bruke programmet?
Det kreves at man har installert [[https://www.rstudio.com/][RStudio]]. Hvis du jobber på OUS, kan man søker om å
få installert programmet fra Sykehuspartner.
* Hvordan bruker man programmet?
Når RStudio er installert så skal men gjøre følgende:
- Bla bla bla
* AIS [2/8]
- [X] Kode 91000.1 vises som 010000.1 i GUI. Check at datadump har 091000.1 (Ingen som har 09**)
- [X] kode ~******.9~ betyr skadegrad er ukjent
- [ ] AIS ~******.1~ skal bort i analysen for nevne. Lage bare en knapp hvis man vil
  inkluderer skadegrad 1
- [ ] Bare høyest skadegradering som teller
- [ ] ISS > 15 betyr alvorlig skade. For ISS beregning er kvadrat av 3 alvorligste AIS
- [ ] Beregn eg. vanligste skade ved en vist type ulykke
- [ ] Lage AIS fane uten ulykketype eller skade mekanismen
- [ ] Beholder duplikater
* Analyse ønsker [7/12]
De er basert på diskusjonen med NTR og bestillingsdokument
- [X] Dashboard med ISS > 15
- [X] Død etter 30 dager (som det er nå)
- [X] Filter for dato Nasjonal - inj_start_date (Traume skjema)
- [X] Filter for dato Sykehus - ed_arrival_dtg (Akutt skjema)
- [ ] Antall fordelt på tid - ukedag (virksomhetsdata)
- [ ] Ulykke og pre-hospital skjema fra sykehus 1 (hosp_serial_num fra Traume Skjema)
- [X] Filter for Alder (traumeskjema "PatientAge")
- [X] Filter for kjønn (traumeskjema "PatientGender" 1=Mann 2=Kvinne)
- [ ] Filter for penetrerende skade (ulykkeskjema - "inj_penetrating" 0:ikke valgt 1:Ja 2:Nei 3:Ukjent)
- [ ] Sykehus opphold for liggertid (Intensiv skjema) hvis mulig
- [ ] Transport forskjellige koder
- [ ] Forklarer alle analysene i shiny
* Kommentar/observasjoner
Tilbakemelding til IKT og kommentarer til data uttrekk som kan forbedres eller endres:
1. Variablenavn ~Valgte ais-koder~ fra /skade/ datasett bør har variablenavn med bare
   *et ord* dvs. uten mellomrom.
2. Navn for HF og RHF trekkes ikke ut i datadump. Den må gjøres for å ha riktig
   navn. Akkurat nå lages liste for HF og RHF manuelt.

* Spørsmål
** Kobling av data
- NTR nummer representerer 1 pasient.
- Traumeskjema har /SkjemaGUID/ som er 1 til 1 mot NTR nummer
- Andre skjema har /HovedskjemaGUID/ som er nøkkelen mot Traumeskjema
** UnitId
- Alle skjemaer har /UnitId/. Filtering for Sykehus, RHF og HF basert på
  /HealthUnitId/ til hvert skjema
** hosp_serial_num fra traumeskjema
- hva skal det brukers til?
** AIS kode for Spine tilleggsuttrekk
